{"format": "layers-model", "generatedBy": "keras v2.5.0", "convertedBy": "TensorFlow.js Converter v3.18.0", "modelTopology": {"keras_version": "2.5.0", "backend": "tensorflow", "model_config": {"class_name": "Functional", "config": {"name": "model_2", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 3, 150, 150], "dtype": "float32", "sparse": false, "ragged": false, "name": "modelInput"}, "name": "modelInput", "inbound_nodes": []}, {"class_name": "ZeroPadding2D", "config": {"name": "LAYER_0_pad", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_first"}, "name": "LAYER_0_pad", "inbound_nodes": [[["modelInput", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "LAYER_0", "trainable": true, "dtype": "float32", "filters": 12, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "LAYER_0", "inbound_nodes": [[["LAYER_0_pad", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "LAYER_1", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "LAYER_1", "inbound_nodes": [[["LAYER_0", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"name": "LAYER_2", "trainable": true, "dtype": "float32", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_first"}, "name": "LAYER_2", "inbound_nodes": [[["LAYER_1", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "LAYER_3_pad", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_first"}, "name": "LAYER_3_pad", "inbound_nodes": [[["LAYER_2", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "LAYER_3", "trainable": true, "dtype": "float32", "filters": 20, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "LAYER_3", "inbound_nodes": [[["LAYER_3_pad", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "LAYER_4", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "LAYER_4", "inbound_nodes": [[["LAYER_3", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "LAYER_5_pad", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_first"}, "name": "LAYER_5_pad", "inbound_nodes": [[["LAYER_4", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "LAYER_5", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "LAYER_5", "inbound_nodes": [[["LAYER_5_pad", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "LAYER_6", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "LAYER_6", "inbound_nodes": [[["LAYER_5", 0, 0, {}]]]}, {"class_name": "Reshape", "config": {"name": "LAYER_8", "trainable": true, "dtype": "float32", "target_shape": [180000]}, "name": "LAYER_8", "inbound_nodes": [[["LAYER_6", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "LAYER_9", "trainable": true, "dtype": "float32", "units": 5, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "LAYER_9", "inbound_nodes": [[["LAYER_8", 0, 0, {}]]]}], "input_layers": [["modelInput", 0, 0]], "output_layers": [["LAYER_9", 0, 0]]}}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "LAYER_0/kernel", "shape": [3, 3, 3, 12], "dtype": "float32"}, {"name": "LAYER_0/bias", "shape": [12], "dtype": "float32"}, {"name": "LAYER_3/kernel", "shape": [3, 3, 12, 20], "dtype": "float32"}, {"name": "LAYER_3/bias", "shape": [20], "dtype": "float32"}, {"name": "LAYER_5/kernel", "shape": [3, 3, 20, 32], "dtype": "float32"}, {"name": "LAYER_5/bias", "shape": [32], "dtype": "float32"}, {"name": "LAYER_9/kernel", "shape": [180000, 5], "dtype": "float32"}, {"name": "LAYER_9/bias", "shape": [5], "dtype": "float32"}]}]}